src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>Ферапонт</name>
      <description>Ферапонт</description>
    </items>
    <items>
      <name>ЭтотПользователь</name>
      <description>Этот пользователь</description>
    </items>
  </predefined>
  <attributes>
    <name>Telegram</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Никнейм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешилПисатьVK</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеНастройки</name>
    <type>
      <types>CatalogRef.ПерсональныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_БотОстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ДневнойПрогресс/ДневнойПрогресс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДневнойПрогресс</name>
  <resources>
    <name>КоличествоСлов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДеньНедели</name>
    <type>
      <types>EnumRef.ДниНедели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Пользователи/ObjectModule.bsl
#Если НаСервере Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;
	
	Попытка
		
		ДН				= ДеньНедели(ТекущаяДатаСеанса());
		Набор 			= РегистрыСведений.ДневнойПрогресс.СоздатьНаборЗаписей();
		ЭлементОтбора 	= Набор.Отбор.Пользователь;	
		ДнейВНеделе		= 7;
		ЕдиницаВремени	= 60;
		ЧасовВСутках	= 24;
		
		ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
		ЭлементОтбора.Установить(Ссылка);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			
			Для Н = 0 По 6 Цикл		
				ЗаполняемыйДень = ?(ДН - Н < 1, ДН - Н + ДнейВНеделе, ДН - Н); 
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = НачалоДня(ТекущаяДатаСеанса()) - (ЕдиницаВремени * ЕдиницаВремени * ЧасовВСутках * Н);
				НоваяЗапись.ДеньНедели = ИнструментарийВызовСервера.ВернутьДеньНедели(ЗаполняемыйДень);
				НоваяЗапись.КоличествоСлов = 0;
				НоваяЗапись.Пользователь = Ссылка;
				Набор.Записать(Истина);
			КонецЦикла;
					
		КонецЕсли;
		
	Исключение
		
		ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки());
		
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
